In [39]:
# Import pandas library
import pandas as pd

In [47]:
# Creating the Series from a list
cat1 = ['Grumpy Cat', 'cat', 2012]

ser = pd.Series(cat1)

print(ser)

0    Grumpy Cat
1           cat
2          2012
3          1400
dtype: object

In [42]:
type(ser)

pandas.core.series.Series

In [48]:
# Create the index
cat_index = ['name', 'species', 'YOB']

# Set the index
ser.index = cat_index
print(ser)

name       Grumpy Cat
species           cat
YOB              2012
weight           1400
dtype: object

In [49]:
# Creating a DataFrame from a list
name = ['Grumpy Cat', 'Garfi the Angry Cat', 'Colonel Meow']
species = ['cat','cat', 'cat']
YOB = [2004, 2012, 2011]

In [52]:
# Creating the Series from a dictionary
cat_dict= {	'name':name,
   	        'species':species, 
            'YOB': YOB}
print(cat_dict)
print(type(cat_dict))

{'name': ['Grumpy Cat', 'Garfi the Angry Cat', 'Colonel Meow'], 'species': ['cat', 'cat', 'cat'], 'YOB': [2004, 2012, 2011]}
<class 'dict'>

In [99]:
df = pd.DataFrame(cat_dict)
print(df)
type(df)

                  name species   YOB
0           Grumpy Cat     cat  2004
1  Garfi the Angry Cat     cat  2012
2         Colonel Meow     cat  2011

pandas.core.frame.DataFrame

In [100]:
print(df["name"])
df["name"]

0             Grumpy Cat
1    Garfi the Angry Cat
2           Colonel Meow
Name: name, dtype: object

0             Grumpy Cat
1    Garfi the Angry Cat
2           Colonel Meow
Name: name, dtype: object

In [101]:
df

                  name species   YOB
0           Grumpy Cat     cat  2004
1  Garfi the Angry Cat     cat  2012
2         Colonel Meow     cat  2011

In [94]:
# https://datagy.io/pandas-drop-index-column/
# df = df.reset_index(drop=True)

# df = df.set_index("name")

# df

                    species   YOB
name
Grumpy Cat              cat  2004
Garfi the Angry Cat     cat  2012
Colonel Meow            cat  2011

In [66]:
df[["name", "YOB"]]
display(df[["species", "YOB"]])

print(df[["name", "YOB"]])

  species   YOB
0     cat  2004
1     cat  2012
2     cat  2011

                  name   YOB
0           Grumpy Cat  2004
1  Garfi the Angry Cat  2012
2         Colonel Meow  2011

In [79]:
df[2:3]

           name species   YOB
2  Colonel Meow     cat  2011

In [103]:
# .loc function is label based.
# this works because the labels are strings.

# df.loc[["Colonel Meow", "Grumpy Cat"],["YOB","species"]] 

df.loc[0:2,["YOB","species"]]

    YOB species
0  2004     cat
1  2012     cat
2  2011     cat

In [105]:
# .iloc function is integer based.
# In this example, we are selecting the first two rows (0:2) and all the columns (:)
# df.iloc[rows, columns]

df.iloc[0:2,[0,2]]

                  name   YOB
0           Grumpy Cat  2004
1  Garfi the Angry Cat  2012

In [108]:
# .iloc function is integer based.
# In this example, we are selecting the first and second rows (0,2) and the first and second columns (0,2)

display(df.iloc[[0,2, 1, 0, 2, 1],[0, 2, 1, 2, 2, 1, 0]])

                  name   YOB species   YOB   YOB species                 name
0           Grumpy Cat  2004     cat  2004  2004     cat           Grumpy Cat
2         Colonel Meow  2011     cat  2011  2011     cat         Colonel Meow
1  Garfi the Angry Cat  2012     cat  2012  2012     cat  Garfi the Angry Cat
0           Grumpy Cat  2004     cat  2004  2004     cat           Grumpy Cat
2         Colonel Meow  2011     cat  2011  2011     cat         Colonel Meow
1  Garfi the Angry Cat  2012     cat  2012  2012     cat  Garfi the Angry Cat

In [109]:
# You can use .head() to see the first 5 rows. You can also specify a custom number of rows to see by specifying it in the parantheses .head(11)
df.head(5)

                  name species   YOB
0           Grumpy Cat     cat  2004
1  Garfi the Angry Cat     cat  2012
2         Colonel Meow     cat  2011

In [110]:
# You can use .tail() to see the last 5 rows. You can also specify a custom number of rows to see by specifying it in the parantheses .tail(11)

df.tail()

                  name species   YOB
0           Grumpy Cat     cat  2004
1  Garfi the Angry Cat     cat  2012
2         Colonel Meow     cat  2011

In [112]:
df = pd.read_csv("/Users/elysium/Documents/01_Code_Academy/03 - Pandas/movies_2.csv")

In [126]:

display(df.head())
display(df.tail())

,MovieID,Title,MPAA Rating,Budget,Gross,Release Date,Genre,Runtime,Rating,Rating Count,Summary
0,1,Look Who's Talking,PG-13,7500000.0,296000000.0,1989-10-12,Romance,93.0,5.9,73638.0,"After a single, career-minded woman is left on..."
1,2,Driving Miss Daisy,PG,7500000.0,145793296.0,1989-12-13,Comedy,99.0,7.4,91075.0,An old Jewish woman and her African-American c...
2,3,Turner & Hooch,PG,13000000.0,71079915.0,1989-07-28,Crime,100.0,7.2,91415.0,"Det. Scott Turner (Tom Hanks) is an uptight, b..."
3,4,Born on the Fourth of July,R,14000000.0,161001698.0,1989-12-20,War,145.0,7.2,91415.0,The biography of Ron Kovic. Paralyzed in the V...
4,5,Field of Dreams,PG,15000000.0,84431625.0,1989-04-21,Drama,107.0,7.5,101702.0,"An Iowa corn farmer, hearing voices, interpret..."

,MovieID,Title,MPAA Rating,Budget,Gross,Release Date,Genre,Runtime,Rating,Rating Count,Summary
611,612,Toy Story 4,G,200000000.0,1.062000e+09,2019-06-11,Animation,100.0,NaN,NaN,NaN
612,613,Fast & Furious Presents: Hobbs & Shaw,PG-13,200000000.0,7.594000e+08,2019-07-13,Thriller,136.0,NaN,NaN,NaN
613,614,The Lion King,PG,250000000.0,1.632000e+09,2019-07-09,Drama,118.0,NaN,NaN,NaN
614,615,Avengers: Endgame,PG-13,356000000.0,2.796000e+09,2019-04-22,Action,181.0,NaN,NaN,NaN
615,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [136]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 616 entries, 0 to 615
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   MovieID       616 non-null    int64
 1   Title         615 non-null    object
 2   MPAA Rating   615 non-null    object
 3   Budget        615 non-null    float64
 4   Gross         615 non-null    float64
 5   Release Date  615 non-null    object
 6   Genre         615 non-null    object
 7   Runtime       615 non-null    float64
 8   Rating        508 non-null    float64
 9   Rating Count  508 non-null    float64
 10  Summary       496 non-null    object
dtypes: float64(5), int64(1), object(5)
memory usage: 53.1+ KB

In [137]:
df.describe()

,MovieID,Budget,Gross,Runtime,Rating,Rating Count
count,616.000000,6.150000e+02,6.150000e+02,615.000000,508.000000,5.080000e+02
mean,307.500000,9.491710e+07,4.453221e+08,118.642276,6.917323,3.392521e+05
std,177.968162,6.748114e+07,3.394075e+08,22.252376,0.888928,3.213388e+05
min,0.000000,6.000000e+04,5.300000e+07,79.000000,4.100000,1.491800e+04
25%,153.750000,4.000000e+07,2.158939e+08,102.000000,6.400000,1.275922e+05
50%,307.500000,8.000000e+07,3.510404e+08,117.000000,6.900000,2.403475e+05
75%,461.250000,1.400000e+08,5.851766e+08,132.000000,7.600000,4.257000e+05
max,615.000000,4.000000e+08,2.796000e+09,201.000000,9.000000,2.127228e+06

In [134]:
# to sort the DF by a column, use the ascending parameter to sort in ascending or descending order
df.sort_values(by='Budget', ascending=False)

,MovieID,Title,MPAA Rating,Budget,Gross,Release Date,Genre,Runtime,Rating,Rating Count,Summary
594,595,Avengers: Infinity War,PG-13,400000000.0,2.048000e+09,2018-04-23,Action,149.0,NaN,NaN,NaN
454,455,Pirates of the Caribbean: On Stranger Tides,PG-13,380000000.0,1.045714e+09,2011-05-14,Action,136.0,6.6,455211.0,Jack Sparrow and Barbossa embark on a quest to...
614,615,Avengers: Endgame,PG-13,356000000.0,2.796000e+09,2019-04-22,Action,181.0,NaN,NaN,NaN
574,575,Star Wars: The Last Jedi,PG-13,317000000.0,1.333000e+09,2019-12-09,Science Fiction,152.0,NaN,NaN,NaN
375,376,Pirates of the Caribbean: At World's End,PG-13,300000000.0,9.610000e+08,2007-05-19,Adventure,169.0,7.1,565402.0,"Captain Barbossa, Will Turner and Elizabeth Sw..."
...,...,...,...,...,...,...,...,...,...,...,...
257,258,My Big Fat Greek Wedding,PG,5000000.0,3.687440e+08,2002-02-22,Comedy,95.0,6.5,114907.0,A young Greek woman falls in love with a non-G...
555,556,Get Out,R,5000000.0,2.524342e+08,2017-02-24,Horror,104.0,NaN,NaN,NaN
59,60,The Crying Game,R,3705538.0,6.254895e+07,1992-09-02,Romance,112.0,7.2,48101.0,A British soldier kidnapped by IRA terrorists ...
198,199,The Blair Witch Project,R,60000.0,2.480000e+08,1999-07-14,Horror,81.0,6.5,220304.0,Three film students vanish after traveling int...
615,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [140]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 616 entries, 0 to 615
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   MovieID       616 non-null    int64
 1   Title         615 non-null    object
 2   MPAA Rating   615 non-null    object
 3   Budget        615 non-null    float64
 4   Gross         615 non-null    float64
 5   Release Date  615 non-null    object
 6   Genre         615 non-null    object
 7   Runtime       615 non-null    float64
 8   Rating        508 non-null    float64
 9   Rating Count  508 non-null    float64
 10  Summary       496 non-null    object
dtypes: float64(5), int64(1), object(5)
memory usage: 53.1+ KB

In [138]:
df.dtypes

MovieID           int64
Title            object
MPAA Rating      object
Budget          float64
Gross           float64
Release Date     object
Genre            object
Runtime         float64
Rating          float64
Rating Count    float64
Summary          object
dtype: object

In [135]:
df.shape

(616, 11)

In [ ]:
movies = df
for x in movies:
    display(x)

In [ ]:
movies.head()

In [ ]:
movies.tail()

In [ ]:
movies_sorted = movies.sort_values(by=["Title"])
movies_sorted.head()

In [ ]:
# Use .shape to see the total rows x columns in a dataframe.
movies.shape

In [ ]:
# Use .describe to calculate statistical data.
movies.describe()

In [ ]:
# .info() function is used to get a summary of the dataframe and it's types, and the number of non-null values.

movies.info()

In [ ]:
movies.tail(10)

In [ ]:
# .isna() detects null values. 
# Combine it with .sum() and you can get a total number of null values in a large DF

movies.isna()

In [ ]:
# .dtypes returns a series with the data type of each column.
movies.dtypes

In [ ]:
movies.head(1)

In [ ]:
# The Release Date is an object, a string type. We can convert this to a date format using .to_datetime()

movies["Release Date"] = pd.to_datetime(movies["Release Date"], format = "%Y/%m/%d")
movies.info()

In [ ]:
# Create new column called day of the week. 
movies["Day of the week"] = movies["Release Date"].dt.day_name
movies.head(15)

In [ ]:
runtime = movies[movies["Runtime"] < 100]
runtime.head(
    
)

In [ ]:
movies[(movies["Release Date"] < "1994-07-14") & (movies["Genre"] == "Action")]

In [ ]:
movies.info()

In [ ]:
movies_test = movies[(movies["MPAA Rating"] == "PG")]

In [ ]:
movies_test.head()

In [ ]:
movies["MPAA Rating"] == "PG"

In [ ]:
movies.head()

In [ ]:
result = pd.DataFrame()
for x in movies:
    
    if x["MPAA Rating"] == "PG":
        # print(x.index())
        print(x)
        # result = movies.concat["Title"]

display(result)

In [ ]:
df_test = movies[["Title", "Release Date"]]

In [ ]:
df_test

In [ ]:
for index, row in movies.iterrows():
    print(row["Title"], row["Release Date"])